# FamilyEnableCuttingInViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyEnableCuttingInViews Property
ParameterTypeId Class See Also
---
"Enable Cutting in Views"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyEnableCuttingInViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyEnableCuttingInViews As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyEnableCuttingInViews {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace